tutorialsDyM/2DOscillatoryDisk/Case1D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------



runApplication blockMesh

# Select cellSets

cp -r 0_org 0


funkySetFields -time 0
overSedDymFoam_rbgh > log&
